final List<dynamic> articleList = [
  {
    'avatarPath': 'https://p.qqan.com/up/2020-10/16037671306141706.jpg',
    "avatarName": "小狗1👌",
    "articleTitle": "小狗的勇敢冒险",
    "brief": "追随小狗的脚步，踏上一场惊险刺激的冒险之旅！与小狗一同面对困难，他会展现出怎样的勇气与智慧呢",
    "imageUrl": "https://p.qqan.com/up/2020-10/16037671306141706.jpg",
    "comments": 5,
    "likes": 50,
    "articleDetail": {
      "title": "小狗的勇敢冒险",
      "images": [
        "https://p.qqan.com/up/2020-10/16037671306141706.jpg",
        'https://tupian.qqw21.com/article/UploadPic/2020-4/2020442233481257.jpg',
        'https://p.qqan.com/up/2017-12/2017120416270177554.jpg',
        'https://tupian.qqw21.com/article/UploadPic/2020-6/2020672249873585.jpg'
      ],
      "article": [
        {
          "state": "text",
          "content":
              "小狗汤姆决定探索附近的森林。勇敢地踏上冒险之路，它遇到了各种挑战和障碍。然而，小狗从不退缩。它用聪明和勇气克服了困难，最终找到了回家的路。小狗汤姆决定探索附近的森林。勇敢地踏上冒险之路，它遇到了各种挑战和障碍。然而，小狗从不退缩。它用聪明和勇气克服了困难，最终找到了回家的路。"
        },
        {"state": "segmentation", "content": "一段时间后"},
        {
          "state": "text",
          "content":
              "小狗汤姆决定探索附近的森林。勇敢地踏上冒险之路，它遇到了各种挑战和障碍。然而，小狗从不退缩。它用聪明和勇气克服了困难，最终找到了回家的路。小狗汤姆决定探索附近的森林。勇敢地踏上冒险之路，它遇到了各种挑战和障碍。然而，小狗从不退缩。它用聪明和勇气克服了困难，最终找到了回家的路。"
        },
        {"state": "segmentation", "content": "一段时间后"},
        {
          "state": "text",
          "content":
              "小狗汤姆决定探索附近的森林。勇敢地踏上冒险之路，它遇到了各种挑战和障碍。然而，小狗从不退缩。它用聪明和勇气克服了困难，最终找到了回家的路。小狗汤姆决定探索附近的森林。勇敢地踏上冒险之路，它遇到了各种挑战和障碍。然而，小狗从不退缩。它用聪明和勇气克服了困难，最终找到了回家的路。"
        },
      ],
      "comments": [
        {
          "avatarUrl": "https://p.qqan.com/up/2017-12/2017120416270177554.jpg",
          "name":"555",
          "content": "小狗真棒"
        },
        {
          "avatarUrl": "https://p.qqan.com/up/2020-10/16037671306141706.jpg",
          "name":"asdasasd",
          "content": "你就是最棒的小狗，加油加油"
        }
      ]
    }
  },
  {
    "avatarPath": "https://tupian.qqw21.com/article/UploadPic/2020-4/2020442233481257.jpg",
    "avatarName": "小锚1👌",
    "articleTitle": "小猫的奇幻冒险",
    "brief": "紧随小猫的足迹踏上一段神奇奇妙的冒险旅程！一起见证小猫展现出的智慧和勇敢，穿越幽深森林，迎接无数挑战。",
    "imageUrl": "https://www.wohaoyun.com/img/M00/07/B8/wKjg2lvW-tiAD68AAAFC7Rpw3CE200.jpg",
    "comments": 8,
    "likes": 60,
    "articleDetail": {
      "title": "小猫的奇幻冒险",
      "images": [
        "https://www.wohaoyun.com/img/M00/07/B8/wKjg2lvW-tiAD68AAAFC7Rpw3CE200.jpg",
        "https://tupian.qqw21.com/article/UploadPic/2020-4/2020442233481257.jpg",
        "https://p.qqan.com/up/2017-12/2017120416270177554.jpg",
        "https://tupian.qqw21.com/article/UploadPic/2020-6/2020672249873585.jpg"
      ],
      "article": [
        {
          "state": "text",
          "content":
              "小猫米咪喜欢冒险探索。一天，它决定进入神秘的古堡，开始了一场令人刺激的奇幻之旅。小猫米咪喜欢冒险探索。一天，它决定进入神秘的古堡，开始了一场令人刺激的奇幻之旅。"
        },
        {"state": "segmentation", "content": "当它环顾四周时"},
        {
          "state": "text",
          "content":
              "小猫发现古堡中隐藏着许多谜团和宝藏。在克服困难和迷失之后，它终于找到了宝藏的所在。小猫发现古堡中隐藏着许多谜团和宝藏。在克服困难和迷失之后，它终于找到了宝藏的所在。"
        },
        {"state": "segmentation", "content": "但就在这时"},
        {
          "state": "text",
          "content":
              "小猫也遭遇到了邪恶的巫婆，它们展开了一场生死搏斗。最终，小猫用机智和勇气战胜了巫婆，拯救了古堡的宝藏。小猫也遭遇到了邪恶的巫婆，它们展开了一场生死搏斗。最终，小猫用机智和勇气战胜了巫婆，拯救了古堡的宝藏。"
        }
      ],
      "comments": [
        {
          "avatarUrl": "https://p.qqan.com/up/2017-12/2017120416270177554.jpg",
          "name":"asdasasd",
          "content": "小猫太可爱了，喜欢它的冒险精神！"
        },
        {
          "avatarUrl": "https://p.qqan.com/up/2020-10/16037671306141706.jpg",
          "name":"asdasasd",
          "content": "加油小猫，你是最棒的！"
        }
      ]
    }
  },
  {
    'avatarPath': 'https://p.qqan.com/up/2017-12/2017120416270177554.jpg',
    "articleTitle": "北极熊的探险之旅",
    "avatarName": "小西1👌",
    "brief": "跟随北极熊的足迹，踏上一段充满冒险与发现的探险之旅。一起探索极地的奇妙世界，见证北极熊展现出的勇气和适应力。",
    "imageUrl": "https://p.qqan.com/up/2017-12/2017120416270177554.jpg",
    "comments": 10,
    "likes": 75,
    "articleDetail": {
      "title": "北极熊的探险之旅",
      "images": [
        "https://www.wohaoyun.com/img/M00/07/B8/wKjg2lvW-tiAD68AAAFC7Rpw3CE200.jpg",
        "https://tupian.qqw21.com/article/UploadPic/2020-4/2020442233481257.jpg",
        "https://www.wohaoyun.com/img/M00/07/B8/wKjg2lvW-tiAD68AAAFC7Rpw3CE200.jpg",
        "https://tupian.qqw21.com/article/UploadPic/2020-6/2020672249873585.jpg"
      ],
      "article": [
        {
          "state": "text",
          "content": "北极熊巴迪生活在广袤的北极冰雪世界。它渴望探索未知的领域，于是它决定展开一次探险之旅。"
        },
        {"state": "segmentation", "content": "在北极的广袤冰雪中"},
        {
          "state": "text",
          "content": "巴迪遭遇了艰难的环境和恶劣的气候条件。然而，它展现出了顽强的求生意志和适应能力，成功克服了一个又一个困难。"
        },
        {"state": "segmentation", "content": "在探险的过程中"},
        {
          "state": "text",
          "content": "巴迪结识了其他北极生物，如海豹、企鹅和北极狐。它们一起合作，共同面对冒险中的挑战，建立起深厚的友谊。"
        },
        {"state": "segmentation", "content": "最终"},
        {
          "state": "text",
          "content": "巴迪不仅成功完成了探险任务，还成为了北极世界的英雄，守护着这片美丽而脆弱的环境。"
        },
        {"state": "segmentation", "content": "在回到家园之时"},
        {"state": "text", "content": "巴迪带着丰富的经历和深刻的感悟，继续在北极展开新的冒险，为保护自然环境而努力。"}
      ],
      "comments": [
        {
          "avatarUrl": "https://p.qqan.com/up/2017-12/2017120416270177554.jpg",
          "name":"asdasasd",
          "content": "北极熊真可爱，希望它们能一直安全健"
        }
      ]
    }
  },
  {
    "avatarPath": 'https://tupian.qqw21.com/article/UploadPic/2020-6/2020672249873585.jpg',
    "avatarName": "小🐶2",
    "articleTitle": "小狗的奇幻冒险",
    "brief": "紧随小狗的足迹踏上一段神奇奇妙的冒险旅程！一起见证小狗展现出的智慧和勇敢，穿越广阔原野，迎接无数挑战。",
    "imageUrl": 'https://tupian.qqw21.com/article/UploadPic/2020-6/2020672249873585.jpg',
    "comments": 8,
    "likes": 60,
    "articleDetail": {
      "title": "小狗的奇幻冒险",
      "images": [
        "https://p.qqan.com/up/2020-10/16037671306141706.jpg",
        "https://tupian.qqw21.com/article/UploadPic/2020-4/2020442233481257.jpg",
        "https://p.qqan.com/up/2017-12/2017120416270177554.jpg",
        "https://tupian.qqw21.com/article/UploadPic/2020-6/2020672249873585.jpg"
      ],
      "article": [
        {"state": "text", "content": "小狗旺财喜欢冒险探索。一天，它决定踏上一段神秘的奇幻冒险之旅。"},
        {"state": "segmentation", "content": "当它踏入陌生的世界时"},
        {
          "state": "text",
          "content": "小狗发现原野中隐藏着无数谜团和宝藏。在克服困难和困惑之后，它终于找到了宝藏的所在。"
        },
        {"state": "segmentation", "content": "然而"},
        {
          "state": "text",
          "content": "小狗也遭遇到了邪恶的魔王，它们展开了一场激烈的战斗。最终，小狗用机智和勇气战胜了魔王，守护了原野的和平。"
        }
      ],
      "comments": [
        {
          "avatarUrl": "https://p.qqan.com/up/2017-12/2017120416270177554.jpg",
          "name":"asdasasd",
          "content": "小狗太可爱了，喜欢它的冒险精神！"
        },
        {
          "avatarUrl": "https://p.qqan.com/up/2020-10/16037671306141706.jpg",
          "name":"asdasasd",
          "content": "加油小狗，你是最棒的！"
        }
      ]
    }
  }
];
